app/controllers/home_controller.rb

  def index
    @images = WebImage.first(10)
---
SELECT  `web_images`.* FROM `web_images`  ORDER BY `web_images`.`id` ASC LIMIT 10