app/controllers/posts_controller.rb

  def index
    if current_user
      @posts = Post.all
---
SELECT `posts`.* FROM `posts`  ORDER BY created_at DESC

  def show
    @recent_posts = Post.all.limit(10)
---
SELECT  `posts`.* FROM `posts`  ORDER BY created_at DESC, `posts`.`created_at` DESC LIMIT 10

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `content`, `created_at`, `updated_at`) VALUES ('My first post', '<h1>Here is my first blog post!</h1><p>Lets write my first paragraph here. With some <b>bold</b>&nbsp;text.</p><p><br></p><p><ul><li>and a list</li><li>and another</li><li>and another for the last time</li></ul><div><br></div></p>', '2015-06-24 02:43:15', '2015-06-24 02:43:15')

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE `posts` SET `content` = '<h1>Here is my first blog post!</h1><p>Lets write my first paragraph here. With some <b>bold</b>&nbsp;text.</p><p><br></p><p></p><ul><li>and a list</li><li>and another</li><li>and another for the last time</li></ul><div><br></div><div><img src=\"http://i.imgur.com/KWZXnwo.jpg\" alt=\"\"><br></div><p></p>', `updated_at` = '2015-06-24 03:06:18' WHERE `posts`.`id` = 1

    def set_post
      @post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 10  ORDER BY created_at DESC LIMIT 1